b = int(input("Введите числовое знаечние первого члена геометрической прогрессии:"))
#Вводим с клавиатуры значение первого члена геометрической прогрессии
print("Первый член прогрессии",b)
#Вывод первого члена
q = int(input("Введите числовое значения множителя геометрической прогрессии "))
#Ввод с клавиатуры значения множителя геометрической прогрессии
print("Множитель прогрессии",q)
#Вывод множителя
n = int(input("Введите номер последнего члена множителя геометрической прогрессии "))
#Ввод с клавиатуры значение последнего члена множителя геометрической прогрессии
print("Последний прогрессии",b)
#вывод последнего члена
z=(b*(q**n-1))/(q-1)
#Формула которая нам посчитает сумму прогрессии
print("Сумма геометрической прогрессии",int(z))
#Вывод суммы