b = int(input("Введите числовое знаечние первого члена геометрической прогрессии:"))
#Вводим с клавиатуры значение первого члена геометрической прогрессии
q = int(input("Введите числовое значения множителя геометрической прогрессии "))
#Ввод с клавиатуры значения множителя геометрической прогрессии
n = int(input("Введите номер последнего члена множителя геометрической прогрессии "))
#Ввод с клавиатуры значение последнего члена множителя геометрической прогрессии
if -10000<=b<=10000 and 1<=q<=50 and 2<=n<=100:
    z=(b*(q**n-1))/(q-1)
    #Формула которая нам посчитает сумму прогрессии
    print("Сумма геометрической прогрессии",int(z))
    #Вывод суммы
else:
    print("ошибка переменной")