s = 0
#Нулевая переменная
n = int(input("Введите число "))
#Ввод числа 
if 1 <= n <= 100000:
#Проверка на условие 
    while n!=0:
    #Цикл будет выполняться пока n не прировняется 0
        n -= 3
        #Отнимаем от нашей переменной 3 т.к. в условии не сказано какие операции и с какми переменными нужно работать, а в примерах вводимые числа и выводимые числа подходили под операцию разности с 3
        s += 1
        #В эту переменную мы добавляем единицу и она работает как счетчик операций
    print("Число операций ", s)
     #Вывод количества операций
else:
    print("Из числа ",n, "не получится получить ноль путём манипуляций с 3 ")
    #В случае если число не подойдёт
