s = 0 
#Нулевая перемменная
n = int(input ("Введите число ")) 
#Ввод числа
if 1<=n<=25: 
#Проверка на условие задачи
      if n !=1:
      #Условие при котором вводимая переменная не равна единице
            for i in range(2,n):
            #Задаем цикл
                  if n % i == 0: 
                  #Проверка на делимость без остатка
                        s += 1 
                  #При условии что переменная делиться на элемент из цикла без остатка то к нулевой переменной добавляем единицу
            if s >= 1: 
            #Условие если нулевая переменная после выполнения цикла увеличилась
                  print("N") 
            #Не является простым числом
            else:
                  print("Y") 
                  #Является простым числом
      else:
            print("N") 
            #Не является простым числом
else:
            print("Ошибка") 
            #При вводе числа не входящего в условие 